# Pandas

## 1. Series

In [1]:
import numpy as np #importing numpy modules

In [2]:
import pandas as pd #importing pandas module

In [3]:
list1=[1,2,3] #Creating a list in python

In [4]:
label=['a','b','c'] #a character list

### arange function is used to create a numpy array of numbers in a given range

In [5]:
arr=np.arange(0,3)

In [6]:
dict={1:'first',2:'second',3:'third'}# creating dictionary

In [7]:
label

['a', 'b', 'c']

### series function in pandas is used for creating a series.

In [8]:
pd.Series(data=list1,index=label)

a    1
b    2
c    3
dtype: int64

In [9]:
pd.Series(label,list1)

1    a
2    b
3    c
dtype: object

In [10]:
pd.Series(dict)

1     first
2    second
3     third
dtype: object

In [11]:
pd.Series(list1,arr)

0    1
1    2
2    3
dtype: int64

In [12]:
arr2=np.array(['india','england','australia']) # creating an array

In [13]:
arr3=np.array(['india','new zealand','england'])

### Creating series from different list and pandas

In [14]:
ser1=pd.Series(list1,arr2)

In [15]:
ser2=pd.Series(list1,arr3)

In [16]:
ser1

india        1
england      2
australia    3
dtype: int64

In [17]:
ser2

india          1
new zealand    2
england        3
dtype: int64

In [18]:
ser1+ser2

australia      NaN
england        5.0
india          2.0
new zealand    NaN
dtype: float64

#### data gets added of same labels

# DataFrames

In [19]:
import numpy as np
import pandas as pd

### pd.DataFrames() is an important function used to create direct pandas dataframes.

In [20]:
df = pd.DataFrame(np.arange(1,31).reshape(3,10),['A','B','C'],[1,2,3,4,5,6,7,8,9,10])

In [21]:
df

   1   2   3   4   5   6   7   8   9   10
A   1   2   3   4   5   6   7   8   9  10
B  11  12  13  14  15  16  17  18  19  20
C  21  22  23  24  25  26  27  28  29  30

In [22]:
df[3]   #returns single series
        #data frame is basically a combination of series

A     3
B    13
C    23
Name: 3, dtype: int32

In [23]:
type(df)

pandas.core.frame.DataFrame

In [24]:
type(df[9])

pandas.core.series.Series

In [25]:
df[[1,6,7]]  #still returns a dataframe(subset)

    1   6   7
A   1   6   7
B  11  16  17
C  21  26  27

In [26]:
df[1]

A     1
B    11
C    21
Name: 1, dtype: int32

In [27]:
df[1]['A']# Returns the value in 1st column and A row.

1

In [28]:
type(df[4]['B'])

numpy.int32

### above was how we can directly find series , i.e a column subset from dataframes

In [29]:
df

   1   2   3   4   5   6   7   8   9   10
A   1   2   3   4   5   6   7   8   9  10
B  11  12  13  14  15  16  17  18  19  20
C  21  22  23  24  25  26  27  28  29  30

In [30]:
df[11]=df[1]+df[2] #we have added a new column to dataframe

In [31]:
df

   1   2   3   4   5   6   7   8   9   10  11
A   1   2   3   4   5   6   7   8   9  10   3
B  11  12  13  14  15  16  17  18  19  20  23
C  21  22  23  24  25  26  27  28  29  30  43

In [32]:
df.drop(11,axis=1) # removing the column from df temprorily

   1   2   3   4   5   6   7   8   9   10
A   1   2   3   4   5   6   7   8   9  10
B  11  12  13  14  15  16  17  18  19  20
C  21  22  23  24  25  26  27  28  29  30

In [33]:
df

   1   2   3   4   5   6   7   8   9   10  11
A   1   2   3   4   5   6   7   8   9  10   3
B  11  12  13  14  15  16  17  18  19  20  23
C  21  22  23  24  25  26  27  28  29  30  43

In [34]:
df.drop(11,axis=1,inplace=True) # Removing the column from df permanently

In [35]:
df

   1   2   3   4   5   6   7   8   9   10
A   1   2   3   4   5   6   7   8   9  10
B  11  12  13  14  15  16  17  18  19  20
C  21  22  23  24  25  26  27  28  29  30

In [36]:
df.drop('A',axis=0) # removing rows from dataframes temprorily

   1   2   3   4   5   6   7   8   9   10
B  11  12  13  14  15  16  17  18  19  20
C  21  22  23  24  25  26  27  28  29  30

In [37]:
df

   1   2   3   4   5   6   7   8   9   10
A   1   2   3   4   5   6   7   8   9  10
B  11  12  13  14  15  16  17  18  19  20
C  21  22  23  24  25  26  27  28  29  30

In [38]:
df.shape # df.shape is a function used to find the total rows and columns of the dataframe.

(3, 10)

In [39]:
df.loc['A'] #Selection rows or grabbing rows which returns series ,,, method-1 by their labels

1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
Name: A, dtype: int32

In [40]:
df.iloc[0] #Grabbing rows by using method which returns a series ,,,method-2 by their indiceszs

1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
Name: A, dtype: int32

In [41]:
df.loc['A',1] # grabbing individual element

1

In [42]:
df.loc[['A','B'],[1,2]] #grabbing a subset

    1   2
A   1   2
B  11  12

# Dataframes part-2

In [43]:
import numpy as np

In [44]:
import pandas as pd

In [45]:
from numpy.random import randn

In [46]:
np.random.seed(101)

In [47]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [48]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df>0 # gives a dataframe of solutions of a boolean condition as mentioned

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [50]:
df[df<0]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B       NaN -0.319318 -0.848077       NaN
C -2.018168       NaN       NaN -0.589001
D       NaN -0.758872 -0.933237       NaN
E       NaN       NaN       NaN       NaN

In [51]:
booldf1=df<0

In [52]:
booldf1

       W      X      Y      Z
A  False  False  False  False
B  False   True   True  False
C   True  False  False   True
D  False   True   True  False
E  False  False  False  False

In [53]:
df[booldf1]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B       NaN -0.319318 -0.848077       NaN
C -2.018168       NaN       NaN -0.589001
D       NaN -0.758872 -0.933237       NaN
E       NaN       NaN       NaN       NaN

In [54]:
booldf2=df['W']>0

In [55]:
booldf2

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [56]:
df[booldf2] #except false row i.e C all are shown

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df[df['X']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df[df['X']>0][['Y','Z']] #one line sentence ,important

          Y         Z
A  0.907969  0.503826
C  0.528813 -0.589001
E  2.605967  0.683509

In [59]:
#   df[(df['X']>0) and (df['Y']<0)]

In [60]:
df[(df['X']>0) & (df['Y']<0)]   # multiple and condition

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [61]:
df[(df['X']>0) | (df['Y']>0)]  #multiple or condition

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [62]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [63]:
# Changing indices to default numbers
df.reset_index()

# to change permanently , use inplace = True

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
# Changing indices by custom choice
new= 'CA AB BC DF IJ'.split()
df['New_column']=new

In [66]:
df

          W         X         Y         Z New_column
A  2.706850  0.628133  0.907969  0.503826         CA
B  0.651118 -0.319318 -0.848077  0.605965         AB
C -2.018168  0.740122  0.528813 -0.589001         BC
D  0.188695 -0.758872 -0.933237  0.955057         DF
E  0.190794  1.978757  2.605967  0.683509         IJ

In [67]:
df.set_index('New_column') # converts a column to new indics

                   W         X         Y         Z
New_column
CA          2.706850  0.628133  0.907969  0.503826
AB          0.651118 -0.319318 -0.848077  0.605965
BC         -2.018168  0.740122  0.528813 -0.589001
DF          0.188695 -0.758872 -0.933237  0.955057
IJ          0.190794  1.978757  2.605967  0.683509

## Dataframes part 3

In [68]:
import numpy as np

In [69]:
import pandas as pd

In [70]:
outside=['G1','G1','G1','G2','G2','G2']#outside ='G1 G1 G1 G2 G2 G2'.split() # list

In [71]:
inside = [1,2,3,1,2,3]

In [72]:
a=zip(outside,inside)
hier_index = list(a)
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [73]:
df2 = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [74]:
df2

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [75]:
# Multilevel indexing

In [76]:
# naming different indices groups
df2.index.names=['Groups','Name']

In [77]:
df2.loc['G1']  #grabbing g1 index which returns a dataframe

             A         B
Name
1     0.302665  1.693723
2    -1.706086 -1.159119
3    -0.134841  0.390528

In [78]:
df2

                    A         B
Groups Name
G1     1     0.302665  1.693723
       2    -1.706086 -1.159119
       3    -0.134841  0.390528
G2     1     0.166905  0.184502
       2     0.807706  0.072960
       3     0.638787  0.329646

In [79]:
df2.loc['G2'].loc[2]  #grabbing g2 which returns a df in which we grab 2nd row which returns a series

A    0.807706
B    0.072960
Name: 2, dtype: float64

In [80]:
df2.loc['G1'].loc[3]['A'] # grabbing df in g1 , then row 3 which is a series , then a particular element in it

-0.13484072060601238

In [81]:
df2.xs('G1') # also used to grab df but ignores all other indices values, see next

             A         B
Name
1     0.302665  1.693723
2    -1.706086 -1.159119
3    -0.134841  0.390528

In [82]:
# We want to grab 1 row in both g1 and g2 therefore
df2.xs(1,level='Name')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502